Core/src/src/InformationRegisters/ШаблоныУникальныхПрефиксовДляДокументов/ШаблоныУникальныхПрефиксовДляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныУникальныхПрефиксовДляДокументов</name>
  <resources>
    <name>ПредствалениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрефиксДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодВПрефиксе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МесяцВПрефиксе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/ШаблоныУникальныхПрефиксовДляДокументов/Forms/Форма/Module.bsl
&НаСервере
Процедура ОбновитьСписокДокументовНаСервере()
	
	ТипыМетаданныхПодписки = Метаданные.ПодпискиНаСобытия.ПриУстановкеНовогоНомера.Источник.Типы();
	Для каждого ТекДокументМД Из Метаданные.Документы Цикл
	
		НовыйДок = Документы[ТекДокументМД.Имя].СоздатьДокумент();
		Если ТипыМетаданныхПодписки.Найти(ТипЗнч(НовыйДок)) <> Неопределено
			И ТекДокументМД.Реквизиты.Найти("Организация") <> Неопределено
			Тогда
		
			НоваяСтрока = ТаблицаДокументов.Добавить();
			НоваяСтрока.ДокументСсылка = НовыйДок.Ссылка;
			НоваяСтрока.ПредствалениеДокумента = ТекДокументМД.Синоним;
			НоваяСтрока.ИмяДокумента = ТекДокументМД.Имя;
		
		КонецЕсли; 
	
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПрефиксов", ТаблицаДокументов.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПрефиксов.ДокументСсылка,
	|	ТаблицаПрефиксов.ПредствалениеДокумента,
	|	ТаблицаПрефиксов.ИмяДокумента,
	|	ТаблицаПрефиксов.ПрефиксДокумента,
	|	ТаблицаПрефиксов.ГодВПрефиксе,
	|	ТаблицаПрефиксов.МесяцВПрефиксе
	|ПОМЕСТИТЬ ВТ_ТаблицаПрефиксов
	|ИЗ
	|	&ТаблицаПрефиксов КАК ТаблицаПрефиксов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПрефиксов.ДокументСсылка,
	|	ВТ_ТаблицаПрефиксов.ПредствалениеДокумента КАК ПредствалениеДокумента,
	|	ВТ_ТаблицаПрефиксов.ИмяДокумента,
	|	ЕСТЬNULL(ШаблоныУникальныхПрефиксовДляДокументов.ПрефиксДокумента, """") КАК ПрефиксДокумента,
	|	ВЫБОР КОГДА ЕСТЬNULL(ШаблоныУникальныхПрефиксовДляДокументов.ПрефиксДокумента, """") <> """" ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Используется,
	|	ЕСТЬNULL(ШаблоныУникальныхПрефиксовДляДокументов.ГодВПрефиксе, ЛОЖЬ) КАК ГодВПрефиксе,
	|	ЕСТЬNULL(ШаблоныУникальныхПрефиксовДляДокументов.МесяцВПрефиксе, ЛОЖЬ) КАК МесяцВПрефиксе
	|ИЗ
	|	ВТ_ТаблицаПрефиксов КАК ВТ_ТаблицаПрефиксов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШаблоныУникальныхПрефиксовДляДокументов КАК ШаблоныУникальныхПрефиксовДляДокументов
	|		ПО ВТ_ТаблицаПрефиксов.ДокументСсылка = ШаблоныУникальныхПрефиксовДляДокументов.ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПредствалениеДокумента";
	ТаблицаДокументов.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДокументов(Команда)
	
	ОбновитьСписокДокументовНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьИзмененияВРегистр()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПрефиксов", ТаблицаДокументов.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПрефиксов.ДокументСсылка,
	|	ТаблицаПрефиксов.ПредствалениеДокумента,
	|	ТаблицаПрефиксов.ИмяДокумента,
	|	ТаблицаПрефиксов.ПрефиксДокумента,
	|	ТаблицаПрефиксов.ГодВПрефиксе,
	|	ТаблицаПрефиксов.МесяцВПрефиксе
	|ПОМЕСТИТЬ ВТ_ТаблицаПрефиксов
	|ИЗ
	|	&ТаблицаПрефиксов КАК ТаблицаПрефиксов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПрефиксов.ДокументСсылка,
	|	ВТ_ТаблицаПрефиксов.ПредствалениеДокумента,
	|	ВТ_ТаблицаПрефиксов.ИмяДокумента,
	|	ВТ_ТаблицаПрефиксов.ПрефиксДокумента,
	|	ВТ_ТаблицаПрефиксов.ГодВПрефиксе,
	|	ВТ_ТаблицаПрефиксов.МесяцВПрефиксе
	|ИЗ
	|	ВТ_ТаблицаПрефиксов КАК ВТ_ТаблицаПрефиксов
	|ГДЕ
	|	ВТ_ТаблицаПрефиксов.ПрефиксДокумента <> """"";
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.ШаблоныУникальныхПрефиксовДляДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры // ЗаписатьИзмененияВРегистр()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокДокументовНаСервере();	
	
КонецПроцедуры


&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	Если Модифицированность Тогда
	
		ЗаписатьИзмененияВРегистр();	
	
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДокументовПрефиксДокументаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ТекущиеДанные = Элементы.ТаблицаДокументов.ТекущиеДанные;
	ТекущиеДанные.Используется = ЗначениеЗаполнено(ТекущиеДанные.ПрефиксДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоЗаполненные(Команда)
	
	Элементы.ТаблицаДокументовПоказатьТолькоЗаполненные.Пометка = НЕ Элементы.ТаблицаДокументовПоказатьТолькоЗаполненные.Пометка;
	Элементы.ТаблицаДокументов.ОтборСтрок = Неопределено;
	Если Элементы.ТаблицаДокументовПоказатьТолькоЗаполненные.Пометка Тогда
	
		Элементы.ТаблицаДокументов.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Используется", Истина)); 
	
	КонецЕсли;
	ТекстЗаголовка = ?(Элементы.ТаблицаДокументовПоказатьТолькоЗаполненные.Пометка,
						НСтр("ru = 'Отобразить все'; ka = 'ყველას ჩვენება'; en = 'Show all'"),
						НСтр("ru = 'Только заполненные'; ka = 'მხოლოდ შევსებულები'; en = 'Only filled'"));
	Элементы.ТаблицаДокументовПоказатьТолькоЗаполненные.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры
